In [4]:
#import necessary Libraries
import pandas as pd 
import numpy as np
import sqlite3
#sadsd=pd.read_csv('Data/bom.movie_gross.csv')

In [2]:
#load data set

In [5]:
conn = sqlite3.connect('Data/im.db')
df=pd.read_sql('Select * from movie_basics', conn)
df
pd.read_sql('Select * from movie_basics', conn)

DatabaseError: Execution failed on sql 'Select * from movie_basics Where primary_title=Avatar': no such column: Avatar

In [4]:
#check to see what values are null
df.isna().any()
len(df[df.runtime_minutes.isna()])/ len(df)
#20% of movies do not have runtime listed

movie_id           False
primary_title      False
original_title      True
start_year         False
runtime_minutes     True
genres              True
dtype: bool

In [5]:
#transform minutes into hours and minutes
#replace na values with average movie length
z=df['runtime_minutes'].mean()
df['runtime_minutes'] = df['runtime_minutes'].fillna(value=z)
df['hours']= df['runtime_minutes']/60
df['minutes']=df['runtime_minutes'] %60
df['minutes']=df['minutes'].round

In [6]:
#other option is drop it
df.dropna(subset=['runtime_minutes'],inplace=True)

In [17]:
#replace original titles that are na with primary title
df['original_title'] = df['original_title'].fillna(value=df['primary_title'])

In [18]:
#replace na genres with none
df['genres'] = df['genres'].fillna(value='None')

In [23]:
#check to see values are okay
df["genres"].value_counts()
df["original_title"].value_counts()
df["primary_title"].value_counts()
df["runtime_minutes"].value_counts()

86.187247     31739
90.000000      7131
80.000000      3526
85.000000      2915
100.000000     2662
              ...
382.000000        1
808.000000        1
653.000000        1
287.000000        1
540.000000        1
Name: runtime_minutes, Length: 368, dtype: int64

In [26]:
movie_akas=pd.read_sql('Select * from movie_akas', conn)
movie_akas

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [29]:

movie_akas["attributes"].value_counts()

new title                      1700
alternative spelling           1394
literal English title          1054
complete title                 1034
original subtitled version      879
                               ...
first season title                1
8mm release title                 1
X-rated version                   1
reissue titleshort version       1
TV listings title                 1
Name: attributes, Length: 77, dtype: int64

In [30]:
movie_akas.isna().any()

movie_id             False
ordering             False
title                False
region                True
language              True
types                 True
attributes            True
is_original_title     True
dtype: bool

In [31]:
len(movie_akas[movie_akas.language.isna()])/ len(movie_akas)

0.87423990738703

In [32]:
len(movie_akas[movie_akas.region.isna()])/ len(movie_akas)

0.16066481159350382

In [33]:
movie_akas['language'] = movie_akas['language'].fillna(value=movie_akas['region'])

In [25]:
pd.read_sql('Select Count(*)  from movie_basics', conn)

   Count(*)
0    146144

In [ ]:
#Anything below This is stuff that we probably will not use more exploratory purposes

In [9]:
#replace none with average
pd.read_sql('Select AVG(runtime_minutes)  from movie_basics', conn)

   AVG(runtime_minutes)
0             86.187247

In [10]:
pd.read_sql('Select * from movie_ratings', conn)

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [11]:
pd.read_sql('Select Count(*)  from movie_ratings', conn)

   Count(*)
0     73856

In [12]:
pd.read_sql('Select Count(*)  from movie_ratings Where numvotes<6', conn)

   Count(*)
0      2699

In [13]:
pd.read_sql('Select Count(*)  from movie_ratings Where numvotes<7', conn)

   Count(*)
0      5574

In [14]:
pd.read_sql('Select AVG(numvotes)  from movie_ratings ', conn)

   AVG(numvotes)
0    3523.662167

In [15]:
pd.read_sql('Select Count(*)  from movie_ratings Where numvotes<1000', conn)

   Count(*)
0     64239

In [35]:
pd.read_sql('Select * from principals', conn)

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

In [36]:
conn.close()